read_verilog mux.v
hierarchy -check -top  mux_synth

proc; opt; fsm; opt; memory; opt

techmap; opt

dfflibmap -liberty cmos_cells.lib

abc -liberty  cmos_cells.lib

clean

write_verilog synth_mux.v
